Repository: eugeneai/bash-essentials-ru-handbok
Catalog: tmx/en-ru-level2.tmx
Source language: en
Languages: ru

source: The algorithms, which will be used, adapted and devised in the project, have natural OR-parallelism (execution branches of a search algorithm are independent each other) in their implementations on MIMD- (Many Instruction Many Data) cluster computing systems, which are characterized with low speed of communication.
ru: Алгоритмы, которые будут использованы, адаптированы и разработаны в проекте, имеют естественный или-параллелизм (выполнение ветвей алгоритма поиска является независимыми) в их реализации на MIMD- (many istruction, many data) кластерных вычислительных систем, которые, как известно, характеризуются низкой скоростью обмена данными по сравнению со скоростью вычислений.

source: The align.seqs command aligns a user-supplied fasta-formatted candidate sequence file to a user-supplied fasta-formatted template alignment.
ru: Команда ```align.seqs``` выравнивает последовательности-кандидаты с шаблонными последовательностями, предстевленные в ```fasta```-формате. Оба файла должны быть заданы пользователем.

source: The analysis is implemented as a Python program scanning the sources for a specific structure.
ru: Анализ реализован в виде программы на Python, сканирующей исходный код и выявляющей определенные структуры.

source: The approach tested on constructing information system, consisting more than 100 classes (including abstract ones).
ru: Подход протестирован на построении информационной системы, состоящей более чем 100 классов (включая абстрактные).

source: The approach to construction of an infrastructure for supporting lake Baikal microbiome research based on Next Generation Sequencing is proposed.
ru: Предлагается подход к созданию инфраструктуры для поддержки исследований микробиома озера Байкал на основе секвенирования следующего поколения.

source: The approach was tested in representation of 144 Mothur modules (an applied package for genetic sequencing analysis) as dataflow block of Rapidminer studio, allowing natural scientists to operate the process of genetic investigations themselves.
ru: Этот подход был опробован в анализе структуры 144 модулей прикладного пакета Mothur (анализ генетических последовательностей) и порождении модуей поточного программирования (dataflow programming) для системы Rapidminer Studio, позволяя ученым-биологам управлять вычислительным процессом в генетических исследованиях.

source: The approach was tested in synthesis of information systems (IS) carcass, having UML diagrams as input and source code of IS components as output.
ru: Данный подход опробован в синтезе каркасов информационных систем (ИС), где UML-диаграммы использовались в качестве входных данных, а на выходе порождался исходный код компонентов ИС.

source: The authors’ positively-constructed formulae approach will be extended with new techniques and modifiers of the default logical inference strategy supporting the implemented simulation techniques.
ru: Аавторский метод позитивно-образованных формул будет расширен новыми методами и модификаторами стратегии поиска логического вывода по умолчанию для поддерки новых систем имитационного моделирования.

source: The backslash is just a safety mechanism.
ru: Обратная косая черта - это механизм "избавления от лишних проблем".

source: The basic idea is that abundant sequences are more likely to generate erroneous sequences than rare sequences.
ru: Основная идея заключается в том, что последовательности, содержащиеся в прочтениях в большом количестве, более вероятно порождают ошибочные последовательности, чем редкие последовательности.

source: The basic syntax for the find command is:
ru: Основным форматом использования команды find является

source: The basic syntax for using grep is the following:
ru: Основной синтаксис для использования grep следующий:

source: The bidding data are collected in the run time accounting various kind of failures.
ru: Данные для торгов собираются во время выполнения прикладных модулей и учитывают различного рода сбои.

source: The bottom one called “lo” is a loopback configuration which redirects the address 127.0.0.1 to “localhost”, and is commonly used for developing web applications.
ru: Нижняя запись, относящаяся к интерфейсу «lo», представляет собой конфигурацию интерфейса обратной связи, его адрес 127.0.0.1, localhost, он обычно используется для разработки веб-приложений.

source: The breadth of concepts go to show the true power of the bash shell.
ru: То, что будем изучать далее показывает истинную мощь оболочки bash.

source: The broadcast address is also listed, but we could easily have derived that from the IP address and the subnet mask as well.
ru: Также указан широковещательный адрес, но он легко получается его из IP-адреса и маски подсети.

source: The chimera.uchime command reads a fasta file and reference file and outputs potentially chimeric sequences.
ru: Команда ```chimera.uchime``` загружает ```fasta```-файл и ```reference```-файл и выводит потенциально химерные последовательности.

source: The code of this external library was not available for me to see, and therefore, I had to use it with limited control.
ru: Код этой библиотеки недоступен, поэтому пришлось использовать его с некоторым ограничением.

source: The comma after the 1 indicates that we want 1 or more matches.
ru: Запятая после "1" означает, что надо именно 1 или более совпадений.

source: The command above sends my site’s homepage 5 separate requests, and we receive data about each request.
ru: Приведенная выше команда отправляет на главную страницу сайта 5 отдельных запросов, в результате получаем данные о каждом запросе.

source: The command we just ran is shown below in this format.
ru: Команда, которую только что запустили, полностью показана ниже.

source: The command will enable you to trim off primer sequences and barcodes, use the barcode information to generate a group file and split a fasta file into sub-files, screen sequences based on the qual file that comes from 454 sequencers, cull sequences based on sequence length and the presence of ambiguous bases and get the reverse complement of your sequences.
ru: Команда позволяет обрезать последовательности праймеров и штрих-кодов, использовать штрих-код-информацию для создания файла групп и разрезать ```fasta```-файлы на компоненты, проводить скрининг последовательностей на основе файла качества, который генерируется 454-секвенаторами, выбраковывать последовательности на основе данных их длин и наличия неоднозначных баз пароснований, а также получать обратные последовательности, комплиментарные исходным.

source: The conference is the main international forum, which presents research on all aspects of the automatic reasoning.
ru: Конференция является главным международным форумом, на котором представляются исследования по всем аспектам автоматических рассуждений.

source: The control is synthesized accounting the uncertainties of the environment, non-ideal functioning the communication and measurement equipment, discretization of the measurement (sampling) and constraints imposed to control resources.
ru: Управление синтезируется с учетом неопределенности окружающей среды, неидеальность функционирования связи и измерительного оборудования, дискретизации процесса измерений (sampling) и ограничений на ресурсы управления.

source: The control is synthesized as a sequence of actions of a trajectory holding imposed constraints in virtual time scale during an significant time period.
ru: Управление синтезируется в виде последовательности действий на траектории состояний объекта, выполняющей заданные ограничения в течении значительного периода виртуального времени.

source: The conversion is expressed, e.g., with a grammar, where each of the grammar rule represents a conversion act.
ru: Преобразование выражается, например, при помощи грамматик, где все правила грамматики представляет собой некоторое преобразование.

source: The conversion is realized using Model Driven Architecture, where model transformation is implemented as logical inference system.
ru: Преобразование осуществляется с использованием архитектуры, управляемой моделями, где трансформация модели реализована как система логического вывода.

source: The count.groups command counts sequences from a specific group or set of groups from the following file types: group, count or shared file.
ru: Команда ```count.groups``` подсчитывает количество последовательностей из определенной группы или множества групп, загружаемых из файлов ```group```, ```count``` и ```shared```.

source: The count.seqs / make.table command counts the number of sequences represented by the representative sequence in a name file.
ru: Коседа ```count.seqs / make.table``` подсчитывает количество последовательностей, соответствующих последовательности представленной в ```name```-файле.

source: The current results are presented and discussed.
ru: Представлены текущие результаты и ближайшие задачи.

source: The data used to interchange between subsystems are based on a variants of XML, which allows programmer to control structure content, and Semantic WEB graphs, lists of triples <subject, relations, object>, written in the Turtle syntax, and used for representing input model data.
ru: Данные, используемые для обмена между подсистемами, - это варианты языка XML, позволяющий программисту контролировать содержимое структур данных; графы Семантического веба, т.е. списки троек <субъект отношение, объект>, представляемые в формате Turtle, которые будут использоваться для представления входных данных моделей.

source: The decisions are the set of three scenarios of a forest harvesting control, fire prevention, finances spent to insect control, etc. corresponding a set of qualitative and quantitative constraints.
ru: В качестве решения выдается три сценария управления лесоготовками, харатеризующимися также параметрами уровня предотвращения пожаров, объекмом финансов, потраченных в борьбе с насекомыми, и т.п., сценарии должны также соответствовать набору качественных и количественных ограничений.

source: The default complete strategy is modified by means of constraints and guides (heuristics), which are just added to the default search strategy, not force the user to program new one.
ru: Полная стратегия по умолчанию может изменяется при помощи ограничений и направляющих (эвристик), которые просто добавляются к стратегии поиска по умолчанию, создавать новые программные реализации при этом не требуется.

source: The default strategy can be modified with adding each rule (a question) a priority, arranging the rules in an order of application, restricting application of a rule when a pattern is recognized, backtracking the inference in case if criteria have not met within a time interval or a number of the inference rule application, checking constraints to the indexed subsets on the stage of substitution figuring out.
ru: Стратегия поиска логического вывода по умолчанию может быть изменена, например, добавлением для каждого правила (вопроса) приоритета, задавая правилам порядок их применения; ограничением применения правила, если распознан некоторый шаблом; реализацией отката (backtracking), если заданные критерии не выполнены в установленный интервал времени или за некоторое число шагов применения правила вывода; проверкой ограничений на индексные подмножества на этапе построения подстановок термов.

source: The degree of deviation is usually determined by the percentage of readings allowed to be removed.
ru: Степень отклонения обычно определяется процентом показаний, которые разрешено удалить.

source: The description is transformed into model and its computer simulation driven with the above mentioned logical engine.
ru: Описание трансформируется в конкретную имитационную модель, управляемую при помощи вышеупомянутых логических средств.

source: The device you searched from is found by the router, the website data is delivered, and we see the homepage of www.thediygolfer.com.
ru: Устройство, с которого вы выполняли поиск, обнаруживается маршрутизатором, данные веб-сайта доставляются, и домашнюю страницу www.thediygolfer.com отображается в браузере.

source: The difference between the commands is the level of interactivity and therefore the situations you would be likely to use them both in.
ru: Разница между командами заключается в уровне интерактивности, опыт показывает, что используются они часто и обе.

source: The easiest way to explain regular expressions is through practical examples and derivations of why we might need a regular expression for a given scenario.
ru: Самый простой способ bpexbnm регулярные выражения - это показать примеры практического использования, и объяснить зачем использовать регулярное выражение для данной задачи.

source: The environment comprises cloud data storage (DaaS) and computational services (SaaS and PaaS), as well as visualization, and data integration services.
ru: Среда включает облачное хранилище данных (DaaS) и вычислительные службы (SaaS и PaaS), а также службы визуализации и интеграции данных.

source: The equivalent command on Mac is the dtruss command, but it does not work exactly the same.
ru: Эквивалентная команда на Mac - dtruss, но она работает по-другому.

source: The evolution of automation in the last decades was adoption of various technologies in industry to achieve (1980s) better production quality thanks to improved management, (1990s) better processes organization (reengineering of business processes), (2000s) collaborative manufacturing and management the process between counterparties.
ru: Эволюция автоматизации в последние десятилетия выражается в адаптации различных технологий в промышленности (1980-е), повышающих качество продукции за счет улучшения управления; (1990-е) лучшая организация бизнес-процессов (реинжиниринг бизнес-процессов); (2000-е) совместного производства и управления информационными процессами между контрагентами.

source: The exec function will do as you might guess and execute a command on every single file that was found by find.
ru: Функция exec позволяет запускать другие команды над найденным find файлом.

source: The expression we just wrote means that we are starting at the beginning of each line and looking for any character except line breaks in a quantity of 1 or more characters.
ru: Выражение, которое мы только что составили, означает, что начиная с начала каждой строки и ищем любой символ (за исключением концов строк) в количестве один или более символов.

source: The find command is eerily similar to grep at first glance, but covers an entirely different use case.
ru: На первый взгляд, команда find очень сильно похожа на grep, но ее использование охватывает решение других задач.

source: The first ^ means "beginning of line" while the
ru: Первый символ "^" означает "начало строки", однако

source: The first conference was held in 1974, were based on the biennium, and annual conferences began in 1996.
ru: Впервые конференция проведена в 1974 году, далее она прводилась раз в два года, в 1996 году она стала ежегодной.

source: The first entry “enp37s0” seems to be an empty configuration.
ru: Первая запись «enp37s0» кажется пустой конфигурацией.

source: The first method is simple.
ru: Первый способ прост.

source: The first one implies that data can be split in subsets, which could be processed independently.
ru: Первая подразумевает, что данные могут быть разделены на подмножества, которые можно обрабатывать независимо.

source: The first step my computer will take is forming a basic HTTP GET request.
ru: Первый шаг, который предпримет компьютер, - это формирование базового HTTP-запроса GET.

source: The following directions are developed: intelligent cluster administration, improving cluster utilization, devising new tools for automation of parallel versions of computer software construction, namely ORLANDO tools [8].
ru: Проводятся исследования по следующим направлениям: интеллектуализация администрирования кластеров, повышения эффективности использования кластера, разрабатка новых инструментов для автоматизации построения параллельных версий программного обеспечения, а именно пакет ORLANDO-tools [8].

source: The following formula will determine how long the system was waiting for resources.
ru: Следующая формула показывает, сколько времени процесс простаивал из-за отсутствия доступа к ресурсам.

source: The following is how we declare a shell variable.
ru: Ниже показано, как объявляются переменные оболочки.

source: The following results will be obtained.
ru: Следующие результаты будут получены.

source: The forward-chaining inference of the PCFs calculus is being adapted to real time computational systems.
ru: Механизм вывода от фактов к цели, используемый в исчислении ПОФ, адаптирован к режиму реального времени.

source: The fourth analysis is referred to as Beta-diversity, which deals with principal component analysis and its analogs, constructs charts of group by similarity in the space of the principal component axes.
ru: Четвертый анализ называется бета-разнообразием, который имеет дело с анализом главных компонент и его аналогами, в результате строятся диаграммы групп по сходству в пространстве осей главных компонент.

source: The free command is a concise way of showing your system resources at a given moment.
ru: Команда free - это быстрый способ оценки ресурсы вашей системы в заданный момент.

source: The further direction of the study is related to using this algorithm in complex technical systems with decentralized group control of problem-solving processes in the conditions of conflict and cooperation.
ru: Дальнейшее направление исследований связано с использованием этого алгоритма в сложных технических системах с децентрализованным групповым управлением в среде конфликтных и кооперирующихся агентов.

source: The general approach is to i) find the closest template for each candidate using kmer searching, blastn, or suffix tree searching; ii) to make a pairwise alignment between the candidate and de-gapped template sequences using the Needleman-Wunsch, Gotoh, or blastn algorithms; and iii) to re-insert gaps to the candidate and template pairwise alignments using the NAST algorithm so that the candidate sequence alignment is compatible with the original template alignment.
ru: Общий подход заключается в том, чтобы: I) найти ближайший шаблон для каждого кандидата, используя kmer-поиск, blastn, или поиск по дереву суффиксов; II) попарно выравнить последовательности кандидата и шаблона, с исключенными промежутками (gap), при помощи алгоритмов Нидлмана-Вунша, Готоха, или blastn; и III) восстановить промежутки в последовательности кандидата и шаблона, провести попарное выравнивание при помощи алгоритма NAST так, чтобы кандидат был совместим с оригинальным выравниванием шаблона.

source: The hi, si, and st are not important to us.
ru: Столбцы hi, si, и st нам не важны.

source: The ifconfig command will give us the information that we just discussed about our LAN (local area network).
ru: Команда ifconfig предоставит нам информацию о домашней локальной сети, которую мы только что обсудили.

source: The inference engine will be adjusted with new modifiers and guides to support time and RAM efficient application of operations, filters and constraints as well as representation of grammars over the multisets.
ru: Механизм поиска вывода будет настроен при помощи новых модификаторов и стратегий (guides) для обеспечения эффективные (по времени и оперативной памяти) выполнение операций и фильтров, проверку ограничений, а также представление грамматик над мультимножествами.

source: The influence of the competing organizations in these models are presented as uncertainties.
ru: Влияние конкурирующих организаций в таких моделях представляются как факторы неопределенности.

source: The instance plan is generated as a result of tender of jobs in a case it be run on a core class, this costs a resource.
ru: План распределения создается в результате тендера задач, запускаемы на определенно классе процессорных ядер; факт назначения задачи на ядро влечет некоторый штраф.

source: The instrumental tools are used by users to intensify their software development.
ru: Инструментальные средства используются для повышения производительности разработки программного обеспечения пользователями.

source: The internet bootstrapped off of the phone system, and nowadays, there are multiple channels of communication running through each telephone wire.
ru: Интернет ранее функционировал на инфраструктуре телефонной системы, и в настоящее время в каждом телефонном проводе орагнизовано несколько каналов связи.

source: The kernel is constantly monitoring all the processes on your computer and allocating one or more of the three system resources to them in intervals.
ru: Ядро постоянно отслеживает состояние всех процессов на компьютере и выделяет им периодически те или иные системные ресурсы

source: The language contains special system predicates and so-called computational function (functions, which are substituted as its calculated value instead its expression), allowing one to control default inference strategy and construct resulting terms.
ru: Язык содержит специальные системные предикаты и так называемые вычислимые функции (функции, которые подставляют вычисленное значение вместо исходного выражения), что позволяет управлять стратегиюей вывода по умолчанию и конструировать результирующие термы.

source: The last one generates Python modules according to an interface definition language that is similar to C/C++.
ru: Последний порождает модули Python согласно спецификации интерфейса, язык которой похож на C и C++.

source: The library contains formulation of problems from many subject areas.
ru: Библиотека содержит постановки задач из многих предметных областей.

source: The local address means that my local host (zubuntu - the fully qualified name for 127.0.0.1) has a socket with ID 35098 open for the given tab in my Google Chrome window.
ru: Локальный адрес означает, что локальный компьютер (zubuntu - полное имя для 127.0.0.1) открыл порт (сокет) с идентификатором 35098 для данной вкладки в окне Google Chrome.

source: The logical object methods synthesize output structure according to a scenario inference of subgoals.
ru: Процедуры логических объектов синтезируют выходные структуры согласно сценарию вывода цепочки подцелей.

source: The longer sequences of the same base pairs in a row, homopolymer, will not exist in nature.
ru: Более длинные последовательности одних и тех же пар оснований в ряду, гомополимера, в природе не существует.

source: The lsof command is used for listing out open files on the system.
ru: Команда lsof используется для вывода списка открытых процессом файлов.

source: The main advantage of our approach in comparison to the popular ones is that our method will try to synthesize a control structure (an algorithm or a list of concrete events in the worst case), which will react on occurring during occurring events bringing the system in a proper state.
ru: Главное преимущество нашего подхода в сравнении с популярными заключается в том, что наш метод будет пытаться синтезировать управляющую структуру (алгоритм или перечень конкретных мероприятий в худшем случае), которые будут реагировать на происходящие в события, приводя систему в допустимое состояние.

source: The main application areas are modeling crowd behavior, energy GRID modeling, market price formation.
ru: Основные области применения этого подхода - моделирование поведения толпы, ГРИД-систем в энергетике, формирование рыночных цен.
